In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 2, np.nan])

In [3]:
s

0    1.0
1    2.0
2    NaN
dtype: float64

In [4]:
s[0]

1.0

In [5]:
s.sum()

3.0

In [6]:
df = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})

In [7]:
df

   A  B
0  1  3
1  2  4

In [8]:
df.dtypes

A    int64
B    int64
dtype: object

In [9]:
df = pd.DataFrame(np.random.randn(6, 4))

In [10]:
df

          0         1         2         3
0 -1.038473  0.545347 -0.032372  0.963722
1  0.130691  0.235752 -0.323409  0.084807
2  0.025871  0.541417 -0.020586  1.168603
3  1.232102  0.984204 -0.354637 -0.809621
4 -0.675379  0.207929 -1.287767 -0.779154
5  1.522883 -0.446236 -0.340461  0.529282

In [11]:
df = pd.DataFrame(np.random.randn(6, 4), index=pd.date_range('20170101', periods=6))

In [12]:
df

                   0         1         2         3
2017-01-01  1.059562 -1.031603 -0.316079  1.534172
2017-01-02  0.072653  0.289074 -0.639173 -0.333918
2017-01-03  0.365393  0.867826  0.320079 -0.735545
2017-01-04  0.013392 -0.646704 -0.553764 -1.059650
2017-01-05  1.458275 -0.315829 -0.627647 -0.589588
2017-01-06  0.198943 -0.314544  1.269949 -0.699656

In [16]:
df = pd.DataFrame(np.random.randn(6, 4), index=pd.date_range('20170101', periods=6), columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2017-01-01  0.163526 -0.818749  1.080516  0.431246
2017-01-02 -1.234686  1.679018 -0.107776 -0.176417
2017-01-03 -2.316664  0.161587  1.851613  0.255652
2017-01-04  1.231135 -0.917014 -0.477312 -1.308446
2017-01-05  0.980431 -0.012462  0.565408  0.029290
2017-01-06 -1.182675 -1.074107  1.484556 -0.734302

In [17]:
df.head(1)

                   A         B         C         D
2017-01-01  0.163526 -0.818749  1.080516  0.431246

In [19]:
df.tail(3)

                   A         B         C         D
2017-01-04  1.231135 -0.917014 -0.477312 -1.308446
2017-01-05  0.980431 -0.012462  0.565408  0.029290
2017-01-06 -1.182675 -1.074107  1.484556 -0.734302

In [20]:
df.index

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06'],
              dtype='datetime64[ns]', freq='D')

In [21]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [26]:
df.values

array([[ 0.16352584, -0.81874874,  1.08051598,  0.4312461 ],
       [-1.2346863 ,  1.67901806, -0.10777628, -0.17641726],
       [-2.31666439,  0.16158732,  1.85161319,  0.25565241],
       [ 1.23113465, -0.91701406, -0.47731209, -1.30844645],
       [ 0.98043076, -0.01246182,  0.56540813,  0.02928981],
       [-1.18267531, -1.07410722,  1.48455572, -0.73430238]])

In [24]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.393156 -0.163621  0.732834 -0.250496
std    1.404732  1.034380  0.909587  0.656971
min   -2.316664 -1.074107 -0.477312 -1.308446
25%   -1.221684 -0.892448  0.060520 -0.594831
50%   -0.509575 -0.415605  0.822962 -0.073564
75%    0.776205  0.118075  1.383546  0.199062
max    1.231135  1.679018  1.851613  0.431246

In [27]:
df.T

   2017-01-01  2017-01-02  2017-01-03  2017-01-04  2017-01-05  2017-01-06
A    0.163526   -1.234686   -2.316664    1.231135    0.980431   -1.182675
B   -0.818749    1.679018    0.161587   -0.917014   -0.012462   -1.074107
C    1.080516   -0.107776    1.851613   -0.477312    0.565408    1.484556
D    0.431246   -0.176417    0.255652   -1.308446    0.029290   -0.734302

In [28]:
df.sort_values(by='B')

                   A         B         C         D
2017-01-06 -1.182675 -1.074107  1.484556 -0.734302
2017-01-04  1.231135 -0.917014 -0.477312 -1.308446
2017-01-01  0.163526 -0.818749  1.080516  0.431246
2017-01-05  0.980431 -0.012462  0.565408  0.029290
2017-01-03 -2.316664  0.161587  1.851613  0.255652
2017-01-02 -1.234686  1.679018 -0.107776 -0.176417

In [29]:
df[0:3]

                   A         B         C         D
2017-01-01  0.163526 -0.818749  1.080516  0.431246
2017-01-02 -1.234686  1.679018 -0.107776 -0.176417
2017-01-03 -2.316664  0.161587  1.851613  0.255652

In [30]:
df['20170102':'20170104']

                   A         B         C         D
2017-01-02 -1.234686  1.679018 -0.107776 -0.176417
2017-01-03 -2.316664  0.161587  1.851613  0.255652
2017-01-04  1.231135 -0.917014 -0.477312 -1.308446

In [31]:
df.loc['20170101']

A    0.163526
B   -0.818749
C    1.080516
D    0.431246
Name: 2017-01-01 00:00:00, dtype: float64

In [33]:
df.loc['20170102', ['A', 'B']]

A   -1.234686
B    1.679018
Name: 2017-01-02 00:00:00, dtype: float64

In [35]:
df.loc[: , ['A', 'B']]

                   A         B
2017-01-01  0.163526 -0.818749
2017-01-02 -1.234686  1.679018
2017-01-03 -2.316664  0.161587
2017-01-04  1.231135 -0.917014
2017-01-05  0.980431 -0.012462
2017-01-06 -1.182675 -1.074107

In [36]:
df.iloc[0, 0]

0.16352584104832577

In [37]:
df.iloc[0:2, 0:2]

                   A         B
2017-01-01  0.163526 -0.818749
2017-01-02 -1.234686  1.679018

In [39]:
df[df.B > 0]

                   A         B         C         D
2017-01-02 -1.234686  1.679018 -0.107776 -0.176417
2017-01-03 -2.316664  0.161587  1.851613  0.255652

In [42]:
df[df > 0]

                   A         B         C         D
2017-01-01  0.163526       NaN  1.080516  0.431246
2017-01-02       NaN  1.679018       NaN       NaN
2017-01-03       NaN  0.161587  1.851613  0.255652
2017-01-04  1.231135       NaN       NaN       NaN
2017-01-05  0.980431       NaN  0.565408  0.029290
2017-01-06       NaN       NaN  1.484556       NaN

In [43]:
df

                   A         B         C         D
2017-01-01  0.163526 -0.818749  1.080516  0.431246
2017-01-02 -1.234686  1.679018 -0.107776 -0.176417
2017-01-03 -2.316664  0.161587  1.851613  0.255652
2017-01-04  1.231135 -0.917014 -0.477312 -1.308446
2017-01-05  0.980431 -0.012462  0.565408  0.029290
2017-01-06 -1.182675 -1.074107  1.484556 -0.734302

In [44]:
df2 = df.copy()
df2 ['E'] = ['one', 'one', 'tow', 'three', 'four', 'three']

In [45]:
df2

                   A         B         C         D      E
2017-01-01  0.163526 -0.818749  1.080516  0.431246    one
2017-01-02 -1.234686  1.679018 -0.107776 -0.176417    one
2017-01-03 -2.316664  0.161587  1.851613  0.255652    tow
2017-01-04  1.231135 -0.917014 -0.477312 -1.308446  three
2017-01-05  0.980431 -0.012462  0.565408  0.029290   four
2017-01-06 -1.182675 -1.074107  1.484556 -0.734302  three

In [46]:
df2[df2['E'].isin(['one', 'four'])]

                   A         B         C         D     E
2017-01-01  0.163526 -0.818749  1.080516  0.431246   one
2017-01-02 -1.234686  1.679018 -0.107776 -0.176417   one
2017-01-05  0.980431 -0.012462  0.565408  0.029290  four

In [47]:
df

                   A         B         C         D
2017-01-01  0.163526 -0.818749  1.080516  0.431246
2017-01-02 -1.234686  1.679018 -0.107776 -0.176417
2017-01-03 -2.316664  0.161587  1.851613  0.255652
2017-01-04  1.231135 -0.917014 -0.477312 -1.308446
2017-01-05  0.980431 -0.012462  0.565408  0.029290
2017-01-06 -1.182675 -1.074107  1.484556 -0.734302

In [48]:
s = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20170101', periods=6))

In [49]:
s

2017-01-01    1
2017-01-02    2
2017-01-03    3
2017-01-04    4
2017-01-05    5
2017-01-06    6
Freq: D, dtype: int64

In [50]:
df['E'] = s

In [51]:
df

                   A         B         C         D  E
2017-01-01  0.163526 -0.818749  1.080516  0.431246  1
2017-01-02 -1.234686  1.679018 -0.107776 -0.176417  2
2017-01-03 -2.316664  0.161587  1.851613  0.255652  3
2017-01-04  1.231135 -0.917014 -0.477312 -1.308446  4
2017-01-05  0.980431 -0.012462  0.565408  0.029290  5
2017-01-06 -1.182675 -1.074107  1.484556 -0.734302  6

In [52]:
df.shift(1)

                   A         B         C         D    E
2017-01-01       NaN       NaN       NaN       NaN  NaN
2017-01-02  0.163526 -0.818749  1.080516  0.431246  1.0
2017-01-03 -1.234686  1.679018 -0.107776 -0.176417  2.0
2017-01-04 -2.316664  0.161587  1.851613  0.255652  3.0
2017-01-05  1.231135 -0.917014 -0.477312 -1.308446  4.0
2017-01-06  0.980431 -0.012462  0.565408  0.029290  5.0

In [53]:
df = pd.DataFrame(np.random.randn(2, 3))

In [54]:
df

          0         1         2
0 -0.322292 -1.208019  0.278276
1  1.946382 -0.345329  1.793820

In [55]:
pd.concat([df, df])

          0         1         2
0 -0.322292 -1.208019  0.278276
1  1.946382 -0.345329  1.793820
0 -0.322292 -1.208019  0.278276
1  1.946382 -0.345329  1.793820

In [57]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])

In [58]:
df

          A         B         C         D
0  0.279108  1.935715 -0.377763 -0.251364
1  0.257199  1.370365 -0.070317 -0.494417
2 -0.036735  1.920574 -0.650284  0.729374
3 -0.199033 -1.702704 -1.220450  0.612414
4  0.824206 -1.041255 -0.946299  2.481457
5  0.989126  1.009979  0.559104  1.331390
6  2.109257 -0.919912 -0.569351  1.599680
7 -3.343848  0.363058  0.234997 -0.520995

In [59]:
s = df.iloc[0]

In [60]:
s

A    0.279108
B    1.935715
C   -0.377763
D   -0.251364
Name: 0, dtype: float64

In [61]:
df.append(s)

          A         B         C         D
0  0.279108  1.935715 -0.377763 -0.251364
1  0.257199  1.370365 -0.070317 -0.494417
2 -0.036735  1.920574 -0.650284  0.729374
3 -0.199033 -1.702704 -1.220450  0.612414
4  0.824206 -1.041255 -0.946299  2.481457
5  0.989126  1.009979  0.559104  1.331390
6  2.109257 -0.919912 -0.569351  1.599680
7 -3.343848  0.363058  0.234997 -0.520995
0  0.279108  1.935715 -0.377763 -0.251364

In [62]:
df.append(s, ignore_index=True)

          A         B         C         D
0  0.279108  1.935715 -0.377763 -0.251364
1  0.257199  1.370365 -0.070317 -0.494417
2 -0.036735  1.920574 -0.650284  0.729374
3 -0.199033 -1.702704 -1.220450  0.612414
4  0.824206 -1.041255 -0.946299  2.481457
5  0.989126  1.009979  0.559104  1.331390
6  2.109257 -0.919912 -0.569351  1.599680
7 -3.343848  0.363058  0.234997 -0.520995
8  0.279108  1.935715 -0.377763 -0.251364

In [64]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar'], 'B':np. random.randn(4)})

In [65]:
df

     A         B
0  foo  0.177475
1  bar  0.242023
2  foo  0.903249
3  bar -0.260258

In [66]:
df.groupby('A').sum()

            B
A
bar -0.018234
foo  1.080724

In [1]:
import pandas_datareader as pdr

/Users/kakiuchishigenao/.pyenv/versions/anaconda3-2019.10/lib/python3.7/site-packages/pandas_datareader/compat/__init__.py:7: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  from pandas.util.testing import assert_frame_equal

In [2]:
start = '2018/1/1'

In [3]:
price = pdr.DataReader('BTC-USD', 'yahoo', start)

In [4]:
price

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2017-12-31,14377.400391,12755.599609,12897.700195,14156.400391,12136299520,14156.400391
2018-01-01,14112.200195,13154.700195,14112.200195,13657.200195,10291200000,13657.200195
2018-01-02,15444.599609,13163.599609,13625.000000,14982.099609,16846600192,14982.099609
2018-01-03,15572.799805,14844.500000,14978.200195,15201.000000,16871900160,15201.000000
2018-01-04,15739.700195,14522.200195,15270.700195,15599.200195,21783199744,15599.200195
...,...,...,...,...,...,...
2020-04-24,7641.363770,7521.672363,7550.482910,7569.936035,32941541446,7569.936035
2020-04-25,7700.594238,7561.407715,7570.139160,7679.867188,33070154490,7679.867188
2020-04-26,7795.601074,7679.418945,7679.418945,7795.601074,36162144724,7795.601074
2020-04-27,7814.527344,7730.806641,7796.970215,7807.058594,33187959920,7807.058594
2020-04-29,7962.160645,7793.264160,7802.059082,7954.843750,36427190272,7954.843750